---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.ConvertingOldAxisToNormal
source: html/88034279-c57e-a27a-21f9-20ad25588733.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.ConvertingOldAxisToNormal Property

This operation will convert the existing axis of revolution to a normal line.

## Syntax (C#)
```csharp
public static FailureDefinitionId ConvertingOldAxisToNormal { get; }
```